INSERT INTO genre ("name")
VALUES ('Реп'), ('Поп-музыка'), ('Рок');


INSERT INTO songwriter ("name")
VALUES ('Баста'), ('Король и Шут'), ('Отпетые машенники'), ('Каста'), ('Тимати'), ('Дискотека Авария'), ('Алиса');


INSERT INTO genre_songwriter (id_genre, id_songwriter)
VALUES (1, 1), (3, 2), (2, 3), (1, 4), (1, 5), (2, 6), (3, 7);


INSERT INTO album ("name", release_year)
VALUES ('Баста 1', 2006), ('Баста 2', 2007), ('Жаль, нет ружья', 2008),
('Как в старой сказке', 2001), ('Фигня', 1999), ('Липкие руки-2', 2000),
('Альбомба', 2021), ('Феникс', 2004), ('13', 2013),
('Олимп', 2016), ('Маньяки', 2001),
('Яйца', 2001),
('Шабаш', 1991), ('Посолонь', 2019);


INSERT INTO album_songwriter
(id_album, id_songwriter)
VALUES (1, 1), (2, 1), (3, 2), (4, 2), (5, 3), (6, 3), (7, 4), (8, 4), (9, 5), (10, 5), (11, 6), (12, 6), (13, 7), (14, 7);


INSERT INTO track ("name", duration, id_album)
VALUES ('Гонка', 310, 1),
('Осень', 215, 1),
('Сон', 312, 2),
('Моя игра', 335, 2),
('Мой характер', 231, 3),
('Представляю я', 190, 3),
('Пират', 235, 4),
('Пивной череп', 180, 4),
('Му-му', 208, 5),
('Гуляка', 182, 5),
('Девушка', 235, 6),
('Люблю', 278, 6),
('Я чувак', 174, 7),
('Муха', 98, 7),
('Сестра', 211, 8),
('Кукловод', 353, 8),
('Море', 285, 9),
('Пролог', 213, 9),
('Олимп', 221, 10),
('Домофон', 222, 10),
('Слова', 232, 11),
('Небо', 270, 11),
('Песня про яйца', 260, 12),
('Вот так', 83, 12),
('Ко мне', 277, 13),
('Сумерки', 253, 13),
('Март', 348, 14),
('Половодье', 310, 14);


INSERT INTO compilation ("name", release_year)
VALUES ('Реп 1', 2017), ('Реп 2', 2022), ('Рок 1', 2020), ('Поп 1', 2010), ('Поп 2', 2013);


INSERT INTO track_compilation (id_track, id_compilation)
VALUES (1, 1), (2, 1), (3, 2), (4, 2), (5, 3), (6, 3), (7, 3), (8, 3), (9, 4), (10, 4), (11, 5), (12, 5), (13, 2), (14, 2), (15, 1), (16, 1), (17, 1), (18, 1), (19, 2), (20, 2), (21, 4), (22, 4), (23, 5), (24, 5), (25, 3), (26, 3), (27, 3), (28, 3);